# BRepBuilderGeometryId Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BRepBuilderGeometryId Properties
BRepBuilderGeometryId Class See Also
---
The BRepBuilderGeometryId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace